update example_3
